
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Создаем Команду
	НоваяКоманда = ЭтаФорма.Команды.Добавить("Расш6270_СоздатьСделкуВБитрикс");
	НоваяКоманда.Действие = "Расш6270_СоздатьСделкуВБитрикс";
	Если ПолучитьНомерСделки(Объект.Ссылка) = Неопределено Тогда
		НоваяКоманда.Заголовок = "Отправить в Битрикс";
	Иначе
		НоваяКоманда.Заголовок = "Открыть в Битрикс";
	КонецЕсли;
	
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("Расш6270_СоздатьСделкуВБитрикс", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ГруппаСтатусПриоритет);
	НоваяКнопка.ИмяКоманды = "Расш6270_СоздатьСделкуВБитрикс";
	НоваяКнопка.Картинка = БиблиотекаКартинок.ОтправитьСообщение;
	НоваяКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
КонецПроцедуры

&НаКлиенте
Процедура Расш6270_СоздатьСделкуВБитрикс(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НомерСделки = ПолучитьНомерСделки(Объект.Ссылка);
		Если НомерСделки = Неопределено Тогда
			Расш6270_Битрикс24.СоздатьСделку(Объект.Ссылка);
			ЭтаФорма.Элементы.Расш6270_СоздатьСделкуВБитрикс.Заголовок = "Открыть в Битрикс";
			
		Иначе
			ПерейтиПоНавигационнойСсылке("https://stroizakaz.bitrix24.ru/crm/deal/details/" + НомерСделки + "/");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерСделки(Ссылка)
	НомерСделки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Расш6270_Состояние.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.Расш6270_Состояние КАК Расш6270_Состояние
		|ГДЕ
		|	Расш6270_Состояние.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НомерСделки = Выборка.Состояние;
	КонецЕсли;
	
	Возврат НомерСделки;
КонецФункции
