
&После("ОбработкаЗаполнения")
Процедура Расш6270_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияЦенНоменклатурыПоставщика") Тогда
		
		ЗаполнитьПоРегистрацииЦенПоставщика(ДанныеЗаполнения, ДанныеЗаполнения);
		
	КонецЕсли; 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Строка") Тогда
		
		ЗаполнитьВидыЦен(ДанныеЗаполнения, ДанныеЗаполнения);
		
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);
КонецПроцедуры

Процедура ЗаполнитьПоРегистрацииЦенПоставщика(Знач ДокументОснование, ДанныеЗаполнения)
	 
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РегистрацияЦенНоменклатурыПоставщикаТовары.Номенклатура КАК Номенклатура,
	|	РегистрацияЦенНоменклатурыПоставщикаТовары.Характеристика КАК Характеристика,
	|	РегистрацияЦенНоменклатурыПоставщикаТовары.Упаковка КАК Упаковка,
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	РегистрацияЦенНоменклатурыПоставщикаТовары.Цена КАК Цена
	|ИЗ
	|	Документ.РегистрацияЦенНоменклатурыПоставщика.Товары КАК РегистрацияЦенНоменклатурыПоставщикаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО (ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании)
	|			И (НЕ ВидыЦен.ПометкаУдаления)
	|			И (ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует))
	|ГДЕ
	|	РегистрацияЦенНоменклатурыПоставщикаТовары.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не требуется вводить установку цен номенклатуры на основании документа %1'"),
			ДокументОснование);
		ВызватьИсключение Текст;
	Иначе
		
		//ЭтотОбъект.ДокументОснование = ДокументОснование;
		ТаблицаНоменклатуры = РезультатЗапроса.Выгрузить(); 
		ЗагрузитьТовары(ТаблицаНоменклатуры);
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК ВидЦены
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления
		|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)");
	    РезультатЗапроса = Запрос.Выполнить();
		
		ЭтотОбъект.ВидыЦен.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьВидыЦен(Знач ДокументОснование, ДанныеЗаполнения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК ВидЦены
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	НЕ ВидыЦен.ПометкаУдаления
	|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)");
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭтотОбъект.ВидыЦен.Загрузить(РезультатЗапроса.Выгрузить());
			
КонецПроцедуры
