
&Вместо("ИдентифицироватьКонтрагента")
Процедура Расш6270_ИдентифицироватьКонтрагента(СтруктураСвойстваЗаказа, ДанныеКонтрагента, ПрикладныеПараметры, ОписаниеОшибки)
	// Вставить содержимое метода.
	ХардКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию("Интернет покупатель");
	ХардПартнер = ХардКонтрагент.Партнер;
	СтруктураСвойстваЗаказа.Вставить("Контрагент", ХардКонтрагент);
	СтруктураСвойстваЗаказа.Вставить("Партнер", ХардПартнер);
	//ПродолжитьВызов(СтруктураСвойстваЗаказа, ДанныеКонтрагента, ПрикладныеПараметры, ОписаниеОшибки);
КонецПроцедуры
