
&Вместо("ЦенаПродажиИОстаткиТовара")
Функция Расш6270_ЦенаПродажиИОстаткиТовара(Номенклатура, Характеристика, Соглашение, Валюта, Склады, ВидыЦен)
	Алексеевка = Справочники.Склады.НайтиПоНаименованию("Алексеевка", Истина);
	Бирюч = Справочники.Склады.НайтиПоНаименованию("Бирюч", Истина);
	Если Склады.НайтиПоЗначению(Алексеевка) <> Неопределено Тогда
		Склады.Добавить(Бирюч);
	ИначеЕсли Склады.НайтиПоЗначению(Бирюч) <> Неопределено Тогда	
		Склады.Добавить(Алексеевка);
	КонецЕсли;
	Результат = ПродолжитьВызов(Номенклатура, Характеристика, Соглашение, Валюта, Склады, ВидыЦен);
	Возврат Результат;
КонецФункции
