
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовыйЭлемент = Элементы.Добавить("СворачиваемаяГруппаДопСведения", Тип("ГруппаФормы"),Элементы.ГруппаПраво);
	НовыйЭлемент.Заголовок 				= "ДополнительныеСведения";
	НовыйЭлемент.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Поведение				= ПоведениеОбычнойГруппы.Свертываемая; 
	НовыйЭлемент.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.ОтображениеУправления 	= ОтображениеУправленияОбычнойГруппы.Картинка;
	
	НовыйЭлемент = Элементы.Добавить("ВыгружатьНаСайт", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_ВыгружатьНаСайт";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;  
	
	НовыйЭлемент = Элементы.Добавить("ВыгружатьДляЯндекса", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_ВыгружатьДляЯндекса";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	НовыйЭлемент = Элементы.Добавить("ИдентификаторSKUЯндекса", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_ShopSKU";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	НовыйЭлемент = Элементы.Добавить("ОсновнаяМодификация", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_ОсновнаяМодификация";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	НовыйЭлемент = Элементы.Добавить("СтатусТовара", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_СтатусТовара";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.КнопкаОчистки		= Истина;
	
	НовыйЭлемент = Элементы.Добавить("СезонныйТовар", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_СезонныйТовар";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.КнопкаОчистки		= Истина;
	
	НовыйЭлемент = Элементы.Добавить("ОсновнойПоставщик", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_ОсновнойПоставщик";
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.КнопкаОчистки		= Истина;
	
	НовыйЭлемент = Элементы.Добавить("Недействителен", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаДопСведения);
	НовыйЭлемент.ПутьКДанным			= "Объект.Расш6270_Недействителен";
	НовыйЭлемент.Вид					= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ТолькоПросмотр			= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Подсказка				= "Номенклатура отмеченая как недействительная, скрывается из всех списков программы, но сведения о ней остаются.";
	НовыйЭлемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
КонецПроцедуры
