
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовыйЭлемент = Элементы.Добавить("ГруппаПеревозчик", Тип("ГруппаФормы"));
	НовыйЭлемент.Заголовок 				= "Перевозчик (только для наемного транспорта)";
	НовыйЭлемент.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
	// НовыйЭлемент.Поведение				= ПоведениеОбычнойГруппы.Свертываемая; 
	НовыйЭлемент.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//НовыйЭлемент.ОтображениеУправления 	= ОтображениеУправленияОбычнойГруппы.Картинка;
	
	НовыйЭлемент = Элементы.Добавить("Расш6270_Партнер", Тип("ПолеФормы"), Элементы.ГруппаПеревозчик);
    НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_Партнер";
    НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	НовыйЭлемент = Элементы.Добавить("Расш6270_Договор", Тип("ПолеФормы"), Элементы.ГруппаПеревозчик);
    НовыйЭлемент.ПутьКДанным		= "Объект.Расш6270_Договор";
    НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ТолькоПросмотр		= Ложь;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
КонецПроцедуры
