
&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметрыТовараПередДобавлениеВКорзину")
Функция Расш6270_ПолучитьПараметрыТовараПередДобавлениеВКорзину(ПараметрыФормы)

	ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара(ТекущаяСтрокаНоменклатуры.Номенклатура);
	ПараметрыТовара.ХарактеристикиИспользуются = Истина;

	ЗаполнитьЗначенияСвойств(ПараметрыТовара, ТекущаяСтрокаНоменклатуры);
	ПараметрыТовара.ЭтоУслуга = ТекущаяСтрокаНоменклатуры.ЭтоУслуга;	
	#Удаление
	Если ТекущаяСтрокаНоменклатуры.ЭтоТовар И Склады.Количество() = 1 Тогда
	#КонецУдаления
	
	#Вставка
	Если ТекущаяСтрокаНоменклатуры.ЭтоТовар И Склады.Количество() > 0 Тогда
	#КонецВставки
		ПараметрыТовара.Склад = Склады.Получить(0).Значение;
	КонецЕсли;

	ПараметрыТовара.КоличествоУпаковок = 1;
	ПараметрыФормыИТовараНаСервере(ПараметрыФормы, ПараметрыТовара);

	Возврат ПараметрыТовара

КонецФункции
