
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Если РольДоступна("ПолныеПрава") Тогда // Проверить на полные права
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Расш6270_ДоступыПользователей.ОбъектДоступа КАК Склад
		|ИЗ
		|	РегистрСведений.Расш6270_ДоступыПользователей КАК Расш6270_ДоступыПользователей
		|ГДЕ
		|	Расш6270_ДоступыПользователей.Пользователь = &Пользователь
		|	И Расш6270_ДоступыПользователей.ОбъектДоступа ССЫЛКА Справочник.Склады";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		МассивСкладов = ВыборкаДетальныеЗаписи.ВыгрузитьКолонку("Склад");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
												"Склад",
												МассивСкладов,
												ВидСравненияКомпоновкиДанных.ВСписке,
												,
												Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
