
&НаКлиенте
Процедура Расш6270_НайтиПоНомеруТелефонаПосле(Команда)
	// для примера
	ЭтаФорма.КодКарты = "";
	ЭтаФорма.Партнер = "";
	Если СтрДлина(ЭтаФорма.НомерТелефона) < 10 ИЛИ СтрДлина(ЭтаФорма.НомерТелефона) > 12 Тогда
		Возврат	
	КонецЕсли;   
	Если СтрДлина(ЭтаФорма.НомерТелефона) = 10 Тогда
		ЭтаФорма.НомерТелефона = "7" + ЭтаФорма.НомерТелефона;
	ИначеЕсли СтрДлина(ЭтаФорма.НомерТелефона) = 11 И Лев(ЭтаФорма.НомерТелефона,1) = "8" Тогда
		ЭтаФорма.НомерТелефона = "7" + Прав(ЭтаФорма.НомерТелефона, 10);
	ИначеЕсли СтрДлина(ЭтаФорма.НомерТелефона) = 12 и лев(ЭтаФорма.НомерТелефона, 2) = "+7" Тогда
		ЭтаФорма.НомерТелефона = "7" + Прав(ЭтаФорма.НомерТелефона, 10);  
	КонецЕсли;
	
	НайденыйПартнер = Расш6270_НайтиНаСервереПоНомеруТелефона(ЭтаФорма.НомерТелефона);
	ЭтаФорма.КодКарты = НайденыйПартнер.Штрихкод;
	ЭтаФорма.Партнер = НайденыйПартнер.Партнер;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Расш6270_НайтиНаСервереПоНомеруТелефона(НомерТелефона)
	// Написать запрос возврацающий штрихкод по номеру телефона 
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
	СтруктураВозврата = Новый Структура("ШтрихКод, Партнер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка.Наименование КАК Наименование,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КартыЛояльности.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ПО (КартыЛояльности.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Тип = &Тип
		|	И ПартнерыКонтактнаяИнформация.НомерТелефона = &НомерТелефона";
	
	Запрос.УстановитьПараметр("Тип", ТипКонтактнойИнформации); 
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		СтруктураВозврата.Партнер = ВыборкаДетальныеЗаписи.Наименование;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

