Функция ПолучитьЗначениеПоляРасшифровки(ДанныеРасшифровки, ИдентификаторРасшифровки) Экспорт
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы;
	НайденныйЭлементРасшифровки = КоллекцияРасшифровки.Получить(ИдентификаторРасшифровки);
	ПоляРасшифровки = НайденныйЭлементРасшифровки.ПолучитьПоля();
	Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		Если ТипЗнч(ПолеРасшифровки.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат ПолеРасшифровки.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции