
&НаКлиенте
Процедура Расш6270_УстановитьЦенуСНДСПосле(Команда)
	// Проверим нужно ли вообще пересчитывать цену.
	Если Объект.ЦенаВключаетНДС Тогда
		Возврат;		
	КонецЕсли;
	Для Каждого СтрТовары Из Объект.Товары Цикл
		СтрТовары.Цена = Окр(СтрТовары.СуммаСНДС / СтрТовары.Количество,2);
		СтрТовары.Сумма = СтрТовары.СуммаСНДС;	
	КонецЦикла;
	Объект.ЦенаВключаетНДС = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура Расш6270_ПринятьОтменитьПриемДокументаПосле(Команда)
	Если Объект.Расш6270_ОтветственныйЗаПрием.Пустая() Тогда
		Объект.Расш6270_ОтветственныйЗаПрием = ПользователиКлиент.ТекущийПользователь();
		ПоказатьОповещениеПользователя("Документ принят, и не доступен для редактирования"); 
		Элементы.Товары.ТолькоПросмотр = Истина;
	Иначе
		Объект.Расш6270_ОтветственныйЗаПрием = Неопределено;
		ПоказатьОповещениеПользователя("Документ доступен для редактирования");
		Элементы.Товары.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Объект.Расш6270_ОтветственныйЗаПрием.Пустая() Тогда
		Элементы.Товары.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
